DatanoiseTV/esp-hosted-open/examples/host_p4_demo/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# Hosted Wi-Fi (radio lives on a remote chip)
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_WIFI_ENABLED=y

# Peer-data RPC channel — required for esp_hosted_open custom RPCs
CONFIG_ESP_HOSTED_ENABLE_PEER_DATA_TRANSFER=y
CONFIG_ESP_HOSTED_MAX_CUSTOM_MSG_HANDLERS=32

# === SDIO host transport ===
# Explicitly select SDIO over the alternatives (SPI / SPI-HD / UART).
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
# CONFIG_ESP_HOSTED_SPI_HOST_INTERFACE is not set
# CONFIG_ESP_HOSTED_SPI_HD_HOST_INTERFACE is not set
# CONFIG_ESP_HOSTED_UART_HOST_INTERFACE is not set

CONFIG_ESP_HOSTED_SDIO_SLOT_0=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000

CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
